Repository: MoeManaseer/QuestionsWebApplication
Catalog: QuestionsWebApplication/Languages/Language.*.resx
Languages: ar

source: Add
ar: إضافة

# AddFailure
source: Something wrong happend while adding.. please try again.
ar: حدث خطأ ما أثناء الإضافة .. يرجى المحاولة مرة أخرى.

# ArabicKey
source: Arabic
ar: عربي

# CodeFailure
source: Something wrong happend with the application.. please contact administrator
ar: حدث خطأ ما في التطبيق .. يرجى الاتصال بالمسؤول

# ConnectionStringFailure
source: Connection string failure.. please try again or change the application settings
ar: فشل سلسلة الاتصال .. يرجى المحاولة مرة أخرى أو تغيير إعدادات التطبيق

source: Create
ar: إنشاء

# DatabaseAuthenticationError
source: The current user is not authenticated in the database.. please change the user or contact administrator
ar: لم يتم توثيق المستخدم الحالي في قاعدة البيانات .. يرجى تغيير المستخدم أو الاتصال بالمسؤول

# DatabaseConnectionDenied
source: The connection to the database was denied, please change the current user or contact adminstartor
ar: تم رفض الاتصال بقاعدة البيانات ، يرجى تغيير المستخدم الحالي أو الاتصال بالمسؤول

# DatabaseConnectionFailure
source: The connection to the database was a failure...
ar: فشل الاتصال بقاعدة البيانات ...

# DatabaseError
source: Something wrong happened with the database.. please contact administrator
ar: حدث خطأ ما في قاعدة البيانات .. يرجى الاتصال بالمسؤول

# DatabaseFailure
source: Something wrong happened with the database.. please contact administrator
ar: حدث خطأ ما في قاعدة البيانات .. يرجى الاتصال بالمسؤول

source: Database name
ar: اسم قاعدة البيانات

# DatabaseNameLength
source: The database name can't be more than 255 charecters in length
ar: لا يمكن أن يزيد طول اسم قاعدة البيانات عن 255 حرفًا

# DatabaseNameRequired
source: The database name can't be empty
ar: لا يمكن أن يكون اسم قاعدة البيانات فارغًا

# DatabaseSQLIncorrect
source: The executed SQL was incorrect.. please contact administrator
ar: تم تنفيذ SQL غير صحيح .. الرجاء الاتصال بالمسؤول

source: Data source
ar: مصدر البيانات

# DataSourceLength
source: The data source can't be more than 255 charecters in length
ar: لا يمكن أن يكون طول مصدر البيانات أكثر من 255 حرفًا

# DataSourceRequired
source: The data source can't be empty
ar: لا يمكن أن يكون مصدر البيانات فارغًا

# DefaultResponse
source: A general error occured.. please try again or contact administrator
ar: حدث خطأ عام .. يرجى المحاولة مرة أخرى أو الاتصال بالمسؤول

source: Delete
ar: حذف

source: Details
ar: تفاصيل

source: Edit
ar: تحديث

# EmptyFields
source: Adding/Updating failed.. there are empty fields.
ar: فشلت عملية الإضافة / التحديث .. هناك حقول فارغة.

# EnglishKey
source: English
ar: إنجليزي

source: Error
ar: خطأ

# ErrorMessage
source: An error occurred while processing your request.
ar: حدث خطأ أثناء معالجة طلبك.

source: Home
ar: الصفحة الرئيسية

# Index
source: Homepage
ar: الصفحة الرئيسية

# IndexBack
source: Back to questions
ar: رجوع إلى الأسئلة

# IndexHeader
source: All Questions
ar: كل الأسئلة

# IntegratedSecurity
source: Authentication type
ar: نوع المصادقة

# IntegratedSecurityRequired
source: The authentication type security can't be empty
ar: لا يمكن أن يكون أمان نوع المصادقة فارغًا

# LanguageKey
source: Language
ar: اللغة

# LanguageRequired
source: The language can't be empty
ar: لا يمكن أن يكون اللغة فارغًا

# ListFail
source: There was an error while fetching the data.. please refresh or try again later
ar: حدث خطأ أثناء جلب البيانات .. يرجى التحديث أو المحاولة مرة أخرى لاحقًا

# NothingToUpdate
source: Adding/Updating failed.. there is nothing to update.
ar: فشلت إضافة / التحديث .. لا يوجد شيء لتحديثه.

# NumberOfSmiley
source: Number of smiley faces
ar: عدد الوجوه المبتسمة

# NumberOfSmileyRange
source: The number of smiley faces must be in the range of 2 to 5
ar: يجب أن يتراوح عدد الوجوه المبتسمة بين 2 و 5

# NumberOfSmileyRequired
source: The number of smiley faces can't be empty
ar: لا يمكن أن يكون عدد الوجوه المبتسمة فارغًا

# NumberOfStar
source: Number of stars
ar: عدد النجوم

# NumberOfStarRange
source: The number of stars must be in the range of 1 to 10
ar: يجب أن يكون عدد النجوم في النطاق من 1 إلى 10

# NumberOfStarRequired
source: The number of stars can't be empty
ar: لا يجوز أن يكون عدد النجوم فارغًا

# OtherKey
source: SQL server authentication
ar: مصادقة خادم SQL

source: Password
ar: كلمه السر

# PasswordLength
source: The password can't be more than 255 charecters in length
ar: لا يمكن أن يزيد طول كلمة المرور عن 255 حرفًا

# Question
source: Question Form
ar: سؤال

# QuestionAddFail
source: Something wrong happend while adding the question..
ar: حدث خطأ ما اثناء اضافة السؤال ..

# QuestionAddSuccess
source: Question added successfully
ar: تمت إضافة السؤال بنجاح

# QuestionAddValidationFail
source: The question was not added, please check the values and make sure they are valid
ar: تمت إضافة السؤال دون نجاح ، يرجى التحقق من القيم والتأكد من صحتها

# QuestionDeleted
source: Something wrong happend while fetching the question.. the question is probably deleted
ar: حدث خطأ ما أثناء إحضار السؤال .. ربما تم حذف السؤال

# QuestionDeleteDeleted
source: Something wrong happend while deleting the question.. The question might be already deleted
ar: حدث خطأ ما أثناء حذف السؤال .. ربما تم حذف السؤال بالفعل

# QuestionDeletedFail
source: The question was not deleted, something wrong happened in the application, try again!
ar: لم يتم حذف السؤال ، حدث خطأ ما في التطبيق ، حاول مرة أخرى!

# QuestionDeleteSuccess
source: The question was removed successfully!
ar: تمت إزالة السؤال بنجاح!

# QuestionEditValidationFail
source: The question was not updated, please check the values and make sure they are valid
ar: تم تحرير السؤال دون نجاح ، يرجى التحقق من القيم والتأكد من صحتها

# QuestionEndValue
source: End value
ar: القيمة النهائية

# QuestionEndValueCaption
source: End value caption
ar: التسمية التوضيحية للقيمة النهائية

# QuestionEndValueCaptionLength
source: The end value caption can't be more than 255 charecters in length
ar: لا يمكن أن يكون طول التسمية التوضيحية لقيمة النهاية أكثر من 255 حرفًا

# QuestionEndValueCaptionRequired
source: The end value caption can't be empty
ar: لا يمكن ترك تسمية توضيحية لقيمة النهاية فارغة

# QuestionEndValueRange
source: The end value must be in the range of 1 to 100
ar: يجب أن تكون القيمة النهائية في النطاق من 1 إلى 100

# QuestionEndValueRequired
source: The end value can't be empty
ar: لا يجوز أن تكون قيمة النهاية فارغة

# QuestionFetchDeleted
source: Something wrong happend while fetching the question.. The question might be deleted
ar: حدث خطأ ما أثناء إحضار السؤال .. قد يتم حذف السؤال

# QuestionFetchFail
source: Something wrong happend while fetching the question.. please try again
ar: حدث خطأ ما أثناء إحضار السؤال .. يرجى المحاولة مرة أخرى

# QuestionNull
source: There isn't a question with that specific id...
ar: لا يوجد سؤال بهذا المعرف المحدد ...

# QuestionOrder
source: Order
ar: ترتيب

# QuestionOrderLength
source: The order must be in the range of 1 to 100
ar: يجب أن يكون الترتيب في النطاق من 1 إلى 100

# QuestionOrderRequired
source: The order can't be empty
ar: لا يمكن أن يكون الطلب فارغًا

# QuestionOutOfDate
source: The question is out of date.. please refresh to get the latest version of data
ar: السؤال قديم .. يرجى التحديث للحصول على أحدث نسخة من البيانات

# QuestionStartValue
source: Start value
ar: قيمه البدايه

# QuestionStartValueCaption
source: Start value caption
ar: بدء التسمية التوضيحية القيمة

# QuestionStartValueCaptionLength
source: The start value caption can't be more than 255 charecters in length
ar: لا يمكن أن يكون طول التسمية التوضيحية لقيمة البداية أكثر من 255 حرفًا

# QuestionStartValueCaptionRequired
source: The start value caption can't be empty
ar: لا يمكن ترك التسمية التوضيحية لقيمة البداية فارغة

# QuestionStartValueRange
source: The start value must be in the range of 1 to 100
ar: يجب أن تكون قيمة البداية في النطاق من 1 إلى 100

# QuestionStartValueRequired
source: The start value can't be empty
ar: لا يجوز أن تكون قيمة البداية فارغة

# QuestionText
source: Text
ar: نص

# QuestionTextLength
source: The text can't be more than 255 charecters in length
ar: لا يمكن أن يزيد طول النص عن 255 حرفًا

# QuestionTextRequired
source: The text can't be empty
ar: لا يجوز أن يكون النص فارغًا

# QuestionType
source: Type
ar: نوع

# QuestionTypeRequired
source: The type can't be empty
ar: لا يمكن أن يكون النوع فارغًا

# QuestionUpdateDeleted
source: Something wrong happend while updating the question.. The question probably got deleted
ar: حدث خطأ ما أثناء تحديث السؤال .. ربما تم حذف السؤال

# QuestionUpdateFail
source: Something wrong happend while editing the question..
ar: حدث خطأ ما أثناء تحرير السؤال ..

# QuestionUpdateSuccess
source: Question updated successfully
ar: تم تحديث السؤال بنجاح

# SaveButton
source: Save
ar: حفظ

# SaveFail
source: Something wrong happend while saving the settings.. please try again!
ar: حدث خطأ ما أثناء حفظ الإعدادات .. يرجى المحاولة مرة أخرى!

# SaveSuccess
source: The settings were saved successfully!
ar: تم حفظ الإعدادات بنجاح!

# ServerConnectionFailure
source: The connection to the server failed.. please check the server name or contact administrator
ar: فشل الاتصال بالخادم .. يرجى التحقق من اسم الخادم أو الاتصال بالمسؤول

# ServerNotFoundOrDown
source: The database server is currently down or is not correct.. please check your settings or contact an administrator
ar: خادم قاعدة البيانات محدث خادم قاعدة البيانات معطل حاليًا أو غير صحيح .. يرجى التحقق من الإعدادات أو الاتصال بمسؤول تم إيقافه مؤقتًا .. يرجى الاتصال بالمسؤول

# ServerPaused
source: The database server is currently paused.. please contact administrator
ar: خادم قاعدة البيانات متوقف مؤقتًا حاليًا .. يرجى الاتصال بالمسؤول

source: Settings
ar: إعدادات

# SliderKey
source: Slider
ar: المنزلق

# SliderValuesValidationMessage
source: Please make sure that the end value is higher than the start value, or they are both 100
ar: يرجى التأكد من أن القيمة النهائية أعلى من قيمة البداية ، أو أن كلاهما 100

# SmileyKey
source: Smiley
ar: مبتسم

# SSPIKey
source: Windows authentication
ar: مصادقة Windows

# StarKey
source: Star
ar: نجمة

# TestButton
source: Test
ar: اختبار

source: Test connection
ar: اختبار الاتصال

# TestFail
source: The connection was unsuccessful, please contact an administrator
ar: لم ينجح الاتصال ، يرجى الاتصال بالمسؤول

# TestingText
source: Testing connection.. please wait!
ar: جارٍ اختبار الاتصال .. يُرجى الانتظار!

# TestSuccess
source: The connection was successful!
ar: كان الاتصال ناجحًا!

# UpToDate
source: Question is up to date!
ar: السؤال محدث!

source: Username
ar: اسم المستخدم

# UsernameLength
source: The username can't be more than 255 charecters in length
ar: لا يمكن أن يزيد طول اسم المستخدم عن 255 حرفًا
